--------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /files/results/log/_main.log
  log type:  text
 opened on:  27 Nov 2025, 12:29:41

. 
. do "code/download_raw_data.do"

. clear all
java.lang.NoClassDefFoundError: Could not initialize class java.awt.Toolkit
        at java.desktop/java.awt.EventQueue.invokeLater(EventQueue.java:1314)
        at com.stata.Javacall.closeAllWindow(Javacall.java:214)
        at com.stata.Javacall.discard(Javacall.java:48)
Caused by: java.lang.ExceptionInInitializerError: Exception java.lang.Unsatisfie
> dLinkError: /usr/local/stata18/utilities/java/linux-x64/zulu-jdk17.0.7/lib/lib
> awt_xawt.so: libXtst.so.6: cannot open shared object file: No such file or dir
> ectory [in thread "main"]
        at java.base/jdk.internal.loader.NativeLibraries.load(Native Method)
        at java.base/jdk.internal.loader.NativeLibraries$NativeLibraryImpl.open(
> NativeLibraries.java:388)
        at java.base/jdk.internal.loader.NativeLibraries.loadLibrary(NativeLibra
> ries.java:232)
        at java.base/jdk.internal.loader.NativeLibraries.loadLibrary(NativeLibra
> ries.java:174)
        at java.base/java.lang.ClassLoader.loadLibrary(ClassLoader.java:2389)
        at java.base/java.lang.Runtime.load0(Runtime.java:755)
        at java.base/java.lang.System.load(System.java:1953)
        at java.base/jdk.internal.loader.NativeLibraries.load(Native Method)
        at java.base/jdk.internal.loader.NativeLibraries$NativeLibraryImpl.open(
> NativeLibraries.java:388)
        at java.base/jdk.internal.loader.NativeLibraries.loadLibrary(NativeLibra
> ries.java:232)
        at java.base/jdk.internal.loader.NativeLibraries.loadLibrary(NativeLibra
> ries.java:174)
        at java.base/jdk.internal.loader.NativeLibraries.findFromPaths(NativeLib
> raries.java:315)
        at java.base/jdk.internal.loader.NativeLibraries.loadLibrary(NativeLibra
> ries.java:285)
        at java.base/java.lang.ClassLoader.loadLibrary(ClassLoader.java:2398)
        at java.base/java.lang.Runtime.loadLibrary0(Runtime.java:818)
        at java.base/java.lang.System.loadLibrary(System.java:1989)
        at java.desktop/java.awt.Toolkit$2.run(Toolkit.java:1388)
        at java.desktop/java.awt.Toolkit$2.run(Toolkit.java:1386)
        at java.base/java.security.AccessController.doPrivileged(AccessControlle
> r.java:318)
        at java.desktop/java.awt.Toolkit.loadLibraries(Toolkit.java:1385)
        at java.desktop/java.awt.Toolkit.initStatic(Toolkit.java:1423)
        at java.desktop/java.awt.Toolkit.<clinit>(Toolkit.java:1397)
        ... 3 more
a Java runtime exception occurred

. set more off

. 
. import delimited using ///
>     "https://fred.stlouisfed.org/graph/fredgraph.csv?id=UNRATE", ///
>     varnames(1) stringcols(1) clear
(encoding automatically selected: ISO-8859-1)
(2 vars, 933 obs)

. 
. rename (observation_date unrate) (date unrate)

. drop if missing(date)
(0 observations deleted)

. duplicates drop date, force

Duplicates in terms of date

(0 observations are duplicates)

. sort date

. 
. save "data/raw/unrate_raw.dta", replace
file data/raw/unrate_raw.dta saved

. 
. clear

. import delimited using ///
>     "https://fred.stlouisfed.org/graph/fredgraph.csv?id=CPIAUCSL", ///
>     varnames(1) stringcols(1) clear
(encoding automatically selected: ISO-8859-1)
(2 vars, 945 obs)

. 
. rename (observation_date cpiaucsl) (date cpi)

. drop if missing(date)
(0 observations deleted)

. duplicates drop date, force

Duplicates in terms of date

(0 observations are duplicates)

. sort date

. 
. save "data/raw/cpi_raw.dta", replace
file data/raw/cpi_raw.dta saved

. 
end of do-file

. do "code/create_analysis_data.do"

. clear all
java.lang.NoClassDefFoundError: Could not initialize class java.awt.Toolkit
        at java.desktop/java.awt.EventQueue.invokeLater(EventQueue.java:1314)
        at com.stata.Javacall.closeAllWindow(Javacall.java:214)
        at com.stata.Javacall.discard(Javacall.java:48)
Caused by: java.lang.ExceptionInInitializerError: Exception java.lang.Unsatisfie
> dLinkError: /usr/local/stata18/utilities/java/linux-x64/zulu-jdk17.0.7/lib/lib
> awt_xawt.so: libXtst.so.6: cannot open shared object file: No such file or dir
> ectory [in thread "main"]
        at java.base/jdk.internal.loader.NativeLibraries.load(Native Method)
        at java.base/jdk.internal.loader.NativeLibraries$NativeLibraryImpl.open(
> NativeLibraries.java:388)
        at java.base/jdk.internal.loader.NativeLibraries.loadLibrary(NativeLibra
> ries.java:232)
        at java.base/jdk.internal.loader.NativeLibraries.loadLibrary(NativeLibra
> ries.java:174)
        at java.base/java.lang.ClassLoader.loadLibrary(ClassLoader.java:2389)
        at java.base/java.lang.Runtime.load0(Runtime.java:755)
        at java.base/java.lang.System.load(System.java:1953)
        at java.base/jdk.internal.loader.NativeLibraries.load(Native Method)
        at java.base/jdk.internal.loader.NativeLibraries$NativeLibraryImpl.open(
> NativeLibraries.java:388)
        at java.base/jdk.internal.loader.NativeLibraries.loadLibrary(NativeLibra
> ries.java:232)
        at java.base/jdk.internal.loader.NativeLibraries.loadLibrary(NativeLibra
> ries.java:174)
        at java.base/jdk.internal.loader.NativeLibraries.findFromPaths(NativeLib
> raries.java:315)
        at java.base/jdk.internal.loader.NativeLibraries.loadLibrary(NativeLibra
> ries.java:285)
        at java.base/java.lang.ClassLoader.loadLibrary(ClassLoader.java:2398)
        at java.base/java.lang.Runtime.loadLibrary0(Runtime.java:818)
        at java.base/java.lang.System.loadLibrary(System.java:1989)
        at java.desktop/java.awt.Toolkit$2.run(Toolkit.java:1388)
        at java.desktop/java.awt.Toolkit$2.run(Toolkit.java:1386)
        at java.base/java.security.AccessController.doPrivileged(AccessControlle
> r.java:318)
        at java.desktop/java.awt.Toolkit.loadLibraries(Toolkit.java:1385)
        at java.desktop/java.awt.Toolkit.initStatic(Toolkit.java:1423)
        at java.desktop/java.awt.Toolkit.<clinit>(Toolkit.java:1397)
        ... 3 more
a Java runtime exception occurred

. set more off

. 
. use "data/raw/unrate_raw.dta", clear

. merge 1:1 date using "data/raw/cpi_raw.dta"

    Result                      Number of obs
    -----------------------------------------
    Not matched                            12
        from master                         0  (_merge==1)
        from using                         12  (_merge==2)

    Matched                               933  (_merge==3)
    -----------------------------------------

. keep if _merge == 3
(12 observations deleted)

. drop _merge

. 
. gen ddate = daily(date,"YMD")

. gen mdate = mofd(ddate)

. format mdate %tm

. drop date ddate

. rename mdate date

. tsset date, monthly

Time variable: date, 1948m1 to 2025m9
        Delta: 1 month

. 
. gen lcpi      = ln(cpi)

. gen inflation = (lcpi - L12.lcpi) * 100
(12 missing values generated)

. 
. drop if missing(inflation, unrate)
(12 observations deleted)

. keep if date >= tm(1970m1)
(252 observations deleted)

. 
. label var date     "Month"

. label var unrate    "Unemployment rate (%)"

. label var inflation "Inflation, CPI y/y (%)"

. 
. save "data/analysis/macro_analysis.dta", replace
file data/analysis/macro_analysis.dta saved

. 
end of do-file

. do "code/analyze_data.do"

. clear all
java.lang.NoClassDefFoundError: Could not initialize class java.awt.Toolkit
        at java.desktop/java.awt.EventQueue.invokeLater(EventQueue.java:1314)
        at com.stata.Javacall.closeAllWindow(Javacall.java:214)
        at com.stata.Javacall.discard(Javacall.java:48)
Caused by: java.lang.ExceptionInInitializerError: Exception java.lang.Unsatisfie
> dLinkError: /usr/local/stata18/utilities/java/linux-x64/zulu-jdk17.0.7/lib/lib
> awt_xawt.so: libXtst.so.6: cannot open shared object file: No such file or dir
> ectory [in thread "main"]
        at java.base/jdk.internal.loader.NativeLibraries.load(Native Method)
        at java.base/jdk.internal.loader.NativeLibraries$NativeLibraryImpl.open(
> NativeLibraries.java:388)
        at java.base/jdk.internal.loader.NativeLibraries.loadLibrary(NativeLibra
> ries.java:232)
        at java.base/jdk.internal.loader.NativeLibraries.loadLibrary(NativeLibra
> ries.java:174)
        at java.base/java.lang.ClassLoader.loadLibrary(ClassLoader.java:2389)
        at java.base/java.lang.Runtime.load0(Runtime.java:755)
        at java.base/java.lang.System.load(System.java:1953)
        at java.base/jdk.internal.loader.NativeLibraries.load(Native Method)
        at java.base/jdk.internal.loader.NativeLibraries$NativeLibraryImpl.open(
> NativeLibraries.java:388)
        at java.base/jdk.internal.loader.NativeLibraries.loadLibrary(NativeLibra
> ries.java:232)
        at java.base/jdk.internal.loader.NativeLibraries.loadLibrary(NativeLibra
> ries.java:174)
        at java.base/jdk.internal.loader.NativeLibraries.findFromPaths(NativeLib
> raries.java:315)
        at java.base/jdk.internal.loader.NativeLibraries.loadLibrary(NativeLibra
> ries.java:285)
        at java.base/java.lang.ClassLoader.loadLibrary(ClassLoader.java:2398)
        at java.base/java.lang.Runtime.loadLibrary0(Runtime.java:818)
        at java.base/java.lang.System.loadLibrary(System.java:1989)
        at java.desktop/java.awt.Toolkit$2.run(Toolkit.java:1388)
        at java.desktop/java.awt.Toolkit$2.run(Toolkit.java:1386)
        at java.base/java.security.AccessController.doPrivileged(AccessControlle
> r.java:318)
        at java.desktop/java.awt.Toolkit.loadLibraries(Toolkit.java:1385)
        at java.desktop/java.awt.Toolkit.initStatic(Toolkit.java:1423)
        at java.desktop/java.awt.Toolkit.<clinit>(Toolkit.java:1397)
        ... 3 more
a Java runtime exception occurred

. set more off

. 
. use "data/analysis/macro_analysis.dta", clear

. 
. twoway ///
>     (scatter unrate inflation, msymbol(circle) msize(small) mcolor(blue)) ///
>     (lfit unrate inflation, lcolor(red) lwidth(medium)), ///
>     ytitle("Unemployment rate (%)") ///
>     xtitle("Inflation, y/y (%)") ///
>     title("Scatterplot of Unemployment vs. Inflation with Fitted Line") ///
>     legend(order(1 "Data" 2 "Linear fit")) ///
>     graphregion(color(white))

. 
. graph export "results/figures/unemployment_inflation.png", ///
>     replace width(1400)
(file results/figures/unemployment_inflation.png not found)
file results/figures/unemployment_inflation.png saved as PNG format

. 
. reg unrate inflation

      Source |       SS           df       MS      Number of obs   =       669
-------------+----------------------------------   F(1, 667)       =      1.87
       Model |  5.49819838         1  5.49819838   Prob > F        =    0.1717
    Residual |  1958.66643       667  2.93653138   R-squared       =    0.0028
-------------+----------------------------------   Adj R-squared   =    0.0013
       Total |  1964.16463       668  2.94036621   Root MSE        =    1.7136

------------------------------------------------------------------------------
      unrate | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   inflation |   .0331725   .0242429     1.37   0.172    -.0144292    .0807741
       _cons |   5.934933   .1151634    51.53   0.000     5.708806    6.161059
------------------------------------------------------------------------------

. 
. esttab using "results/tables/phillips_regression.txt", ///
>     replace se label ///
>     title("Regression of unemployment on inflation") ///
>     b(%6.3f) se(%6.3f)
(file results/tables/phillips_regression.txt not found)
(output written to results/tables/phillips_regression.txt)

. 
end of do-file

. 
. log close
      name:  <unnamed>
       log:  /files/results/log/_main.log
  log type:  text
 closed on:  27 Nov 2025, 12:29:44
--------------------------------------------------------------------------------
