--------------------------------------------------
      name:  <unnamed>
       log:  /Users/krise/Documents/GitHub/review-
> of-financial-studies/template-stata/results/log/
> main.log
  log type:  text
 opened on:  11 Dec 2025, 12:24:24

. 
. * Run code
. do "code/download_raw_data.do"

. clear all

. set more off

. 
. import delimited using ///
>     "https://fred.stlouisfed.org/graph/fredgraph
> .csv?id=UNRATE", ///
>     varnames(1) stringcols(1) clear
(encoding automatically selected: ISO-8859-1)
(2 vars, 933 obs)

. 
. rename (observation_date unrate) (date unemploym
> ent_rate)

. drop if missing(date)
(0 observations deleted)

. duplicates drop date, force

Duplicates in terms of date

(0 observations are duplicates)

. sort date

. 
. pq save "data/raw/unemployment_rate.parquet", re
> place
File saved to /Users/krise/Documents/GitHub/review
> -of-financial-studies/template-stata/data/raw/un
> employment_rate.parquet

. 
. clear

. import delimited using ///
>     "https://fred.stlouisfed.org/graph/fredgraph
> .csv?id=CPIAUCSL", ///
>     varnames(1) stringcols(1) clear
(encoding automatically selected: ISO-8859-1)
(2 vars, 945 obs)

. 
. rename (observation_date cpiaucsl) (date cpi)

. drop if missing(date)
(0 observations deleted)

. duplicates drop date, force

Duplicates in terms of date

(0 observations are duplicates)

. sort date

. 
. pq save "data/raw/cpi.parquet", replace
File saved to /Users/krise/Documents/GitHub/review
> -of-financial-studies/template-stata/data/raw/cp
> i.parquet

. 
end of do-file

. do "code/create_analysis_data.do"

. clear all

. set more off

. 
. pq use "data/raw/unemployment_rate.parquet", cle
> ar

. pq merge 1:1 date using "data/raw/cpi.parquet"
Loading parquet file and saving to temporary dta

    Variable |        Obs        Mean    Std. dev.
>        Min        Max
-------------+------------------------------------
> ---------------------
        date |          0
         cpi |        945    123.4215    88.82391 
>      21.48    324.368
Merging to data

    Result                      Number of obs
    -----------------------------------------
    Not matched                            12
        from master                         0  (_m
> erge==1)
        from using                         12  (_m
> erge==2)

    Matched                               933  (_m
> erge==3)
    -----------------------------------------

. keep if _merge == 3
(12 observations deleted)

. drop _merge

. 
. gen date_daily = daily(date,"YMD")

. gen date_monthly = mofd(date_daily)

. format date_monthly %tm

. drop date date_daily

. rename date_monthly date

. tsset date, monthly

Time variable: date, 1948m1 to 2025m9
        Delta: 1 month

. 
. gen inflation = (cpi - L12.cpi) / L12.cpi * 100
(12 missing values generated)

. drop if missing(inflation, unemployment_rate)
(12 observations deleted)

. keep if date >= tm(1970m1)
(252 observations deleted)

. 
. pq save "data/analysis/macro_data.parquet", repl
> ace
File saved to /Users/krise/Documents/GitHub/review
> -of-financial-studies/template-stata/data/analys
> is/macro_data.parquet

. 
end of do-file

. do "code/analyze_data.do"

. clear all

. set more off

. 
. pq use "data/analysis/macro_data.parquet", clear

. 
. label var date "Month"

. label var unemployment_rate "Unemployment rate (
> %)"

. label var inflation "Inflation, CPI y/y (%)"

. 
. twoway ///
>     (scatter unemployment_rate inflation, msymbo
> l(circle) msize(small) mcolor(blue)) ///
>     (lfit unemployment_rate inflation, lcolor(re
> d) lwidth(medium)), ///
>     ytitle("Unemployment rate (%)") ///
>     xtitle("Inflation, y/y (%)") ///
>     title("Scatterplot of Unemployment vs. Infla
> tion with Fitted Line") ///
>     legend(order(1 "Data" 2 "Linear fit")) ///
>     graphregion(color(white))

. 
. graph export "results/figures/unemployment_infla
> tion.png", ///
>     replace width(1400)
file
    /Users/krise/Documents/GitHub/review-of-fina
    > ncial-studies/template-stata/results/figur
    > es/unemployment_inflation.png saved as PNG
    format

. 
. reg unemployment_rate inflation

      Source |       SS           df       MS     
>  Number of obs   =       669
-------------+----------------------------------  
>  F(1, 667)       =      2.10
       Model |  6.15573519         1  6.15573519  
>  Prob > F        =    0.1481
    Residual |  1958.00889       667  2.93554556  
>  R-squared       =    0.0031
-------------+----------------------------------  
>  Adj R-squared   =    0.0016
       Total |  1964.16463       668  2.94036621  
>  Root MSE        =    1.7133

--------------------------------------------------
> ----------------------------
unemployme~e | Coefficient  Std. err.      t    P>
> |t|                                             
>         [95% con                                
>                 f. interval]
-------------+------------------------------------
> ----------------------------
   inflation |   .0331267   .0228762     1.45   0.
> 148                                             
>        -.0117912                                
>                     .0780447
       _cons |   5.931275   .1129899    52.49   0.
> 000                                             
>         5.709416                                
>                     6.153134
--------------------------------------------------
> ----------------------------

. 
. esttab using "results/tables/phillips_regression
> .txt", ///
>     replace se label ///
>     title("Regression of unemployment on inflati
> on") ///
>     b(%6.3f) se(%6.3f)
(output written to results/tables/phillips_regress
> ion.txt)

. 
end of do-file

. 
. * Close log
. log close
      name:  <unnamed>
       log:  /Users/krise/Documents/GitHub/review-
> of-financial-studies/template-stata/results/log/
> main.log
  log type:  text
 closed on:  11 Dec 2025, 12:24:25
--------------------------------------------------
